angle/sstlm/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh    dynamicMotionSolverFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );




solver          displacementLaplacian;
displacementLaplacianCoeffs
{
    diffusivity  	quadratic    inverseDistance  (wall);
}

  

    dynamicMotionFunction  angularOscillatingDisplacement;
  patches        (wall);


        
// ************************************************************************* //
